In [ ]:
import pandas as pd

In [ ]:
df = pd.read_csv('salaries_by_college_major.csv')

In [ ]:
pd.options.display.float_format = '{:,.2f}'.format

^^^ Change the Pandas formatting option to neatly the numbers

In [ ]:
df.head()

     Undergraduate Major  ...     Group
0             Accounting  ...  Business
1  Aerospace Engineering  ...      STEM
2            Agriculture  ...  Business
3           Anthropology  ...      HASS
4           Architecture  ...  Business

[5 rows x 6 columns]

In [ ]:
df.shape

(51, 6)

In [ ]:
df.columns

Index(['Undergraduate Major', 'Starting Median Salary',
       'Mid-Career Median Salary', 'Mid-Career 10th Percentile Salary',
       'Mid-Career 90th Percentile Salary', 'Group'],
      dtype='object')

In [ ]:
df.isna()

    Undergraduate Major  ...  Group
0                 False  ...  False
1                 False  ...  False
2                 False  ...  False
3                 False  ...  False
4                 False  ...  False
5                 False  ...  False
6                 False  ...  False
7                 False  ...  False
8                 False  ...  False
9                 False  ...  False
10                False  ...  False
11                False  ...  False
12                False  ...  False
13                False  ...  False
14                False  ...  False
15                False  ...  False
16                False  ...  False
17                False  ...  False
18                False  ...  False
19                False  ...  False
20                False  ...  False
21                False  ...  False
22                False  ...  False
23                False  ...  False
24                False  ...  False
25                False  ...  False
26                False  ...  False
27                False  ...  False
28                False  ...  False
29                False  ...  False
30                False  ...  False
31                False  ...  False
32                False  ...  False
33                False  ...  False
34                False  ...  False
35                False  ...  False
36                False  ...  False
37                False  ...  False
38                False  ...  False
39                False  ...  False
40                False  ...  False
41                False  ...  False
42                False  ...  False
43                False  ...  False
44                False  ...  False
45                False  ...  False
46                False  ...  False
47                False  ...  False
48                False  ...  False
49                False  ...  False
50                False  ...   True

[51 rows x 6 columns]

In [ ]:
df.tail()

      Undergraduate Major  ...  Group
46             Psychology  ...   HASS
47               Religion  ...   HASS
48              Sociology  ...   HASS
49                Spanish  ...   HASS
50  Source: PayScale Inc.  ...    NaN

[5 rows x 6 columns]

In [ ]:
clean_df = df.dropna()

In [ ]:
clean_df.tail()

   Undergraduate Major     Spread  ...  Mid-Career 90th Percentile Salary  Group
45   Political Science 126,800.00  ...                         168,000.00   HASS
46          Psychology  95,400.00  ...                         127,000.00   HASS
47            Religion  66,700.00  ...                          96,400.00   HASS
48           Sociology  87,300.00  ...                         118,000.00   HASS
49             Spanish  65,400.00  ...                          96,400.00   HASS

[5 rows x 7 columns]

In [ ]:
clean_df['Starting Median Salary'].max()

74300.0

 ^^^ Use the .max() function to get the highest value in a column of a dataframe. The .max() function is a function in the DataFrame class.

In [ ]:
clean_df['Starting Median Salary'].idxmax()

43

^^^ Use the .idxmax() function to get the index of the row with the largest value in a column.

In [ ]:
clean_df['Undergraduate Major'].loc[43]

'Physician Assistant'

^^^ Since the .idmax() returned 43, to see the name of the major that corresponds to that particular row, we can use the .loc (location) property.

In [ ]:
clean_df.loc[43]

Undergraduate Major                  Physician Assistant
Starting Median Salary                             74300
Mid-Career Median Salary                           91700
Mid-Career 10th Percentile Salary                  66400
Mid-Career 90th Percentile Salary                 124000
Group                                               STEM
Name: 43, dtype: object

^^^ If you don't specify a particular column you can use the .loc (location) property to retrieve an entire row:

Challenge 1:
What college major has the highest mid-career salary? How much do graduates with this major earn? (Mid-career is defined as having 10+ years of experience).

In [ ]:
row_index = df['Mid-Career Median Salary'].idxmax()
print(f"""{clean_df.loc[row_index]['Undergraduate Major']} major earns
${clean_df.loc[row_index]['Mid-Career 90th Percentile Salary']}""")

Chemical Engineering major earns
$194000.0

Challenge 2: 
Which college major has the lowest starting salary and how much do graduates earn after university?

In [ ]:
row_index = clean_df['Starting Median Salary'].idxmin()
print(f"""
{clean_df.loc[row_index]['Undergraduate Major']} major earns
${clean_df.loc[row_index]['Starting Median Salary']} upon graduation.
""")

Spanish major earns
$34000.0 upon graduation.

Challenge 3:
Which college major has the lowest mid-career salary and how much can people expect to earn with this degree?

In [ ]:
row_index = clean_df['Mid-Career Median Salary'].idxmin()
print(f"""
People with a degree in {clean_df.loc[row_index]['Undergraduate Major']}
can expect to earn ${clean_df.loc[row_index]['Mid-Career Median Salary']} mid career.
""")

People with a degree in Education
can expect to earn $52000.0 mid career.

How would we calculate the difference between the earnings of the 10th and 90th percentile? Well, Pandas allows us to do simple arithmetic with entire columns, so all we need to do is take the difference between the two columns, and then we can add this new column object to the existing dataframe with df.insert(index, title, column_data)

In [ ]:
spread_col = clean_df['Mid-Career 90th Percentile Salary'] - clean_df['Mid-Career 10th Percentile Salary']
clean_df.insert(1, 'Spread', spread_col)

To see which degrees have the smallest spread of earnings between the 10th and 90th percentile, we can use the .sort_values() method. A higher spread indicates more volatility in earnings potential. And since we are interested in only seeing the name of the degree and the major, we can pass a list of these two column names to look at the .head() of these two columns exclusively.

In [ ]:
low_risk = clean_df.sort_values('Spread')
low_risk[['Undergraduate Major', 'Spread']].head()

           Undergraduate Major   Spread
40                     Nursing  50700.0
43         Physician Assistant  57600.0
41                   Nutrition  65300.0
49                     Spanish  65400.0
27  Health Care Administration  66400.0

In [ ]:
print(clean_df.loc[22]['Undergraduate Major'])
print(clean_df.loc[22]['Starting Median Salary'])
print(clean_df.loc[22]['Mid-Career Median Salary'])
print(clean_df.loc[22]['Mid-Career 90th Percentile Salary'])

Finance
47900.0
88300.0
195000.0

Challenge 4:
Using the .sort_values() method, can you find the degrees with the highest potential? Find the top 5 degrees with the highest values in the 90th percentile.

In [ ]:
top_earnings_potential = clean_df.sort_values('Mid-Career 90th Percentile Salary', ascending=False)
top_earnings_potential[['Undergraduate Major', 'Mid-Career 90th Percentile Salary']].head()

     Undergraduate Major  Mid-Career 90th Percentile Salary
17             Economics                           210000.0
22               Finance                           195000.0
8   Chemical Engineering                           194000.0
37                  Math                           183000.0
44               Physics                           178000.0

Challenge 5:
Find the degrees with the greatest spread in salaries. Which majors have the largest difference between high and low earners after graduation.

In [ ]:
high_risk = clean_df.sort_values('Spread', ascending=False)
high_risk[['Undergraduate Major', 'Spread']].head()

   Undergraduate Major    Spread
17           Economics  159400.0
22             Finance  147800.0
37                Math  137800.0
36           Marketing  132900.0
42          Philosophy  132500.0

In [ ]:
clean_df.groupby('Group').count()

          Undergraduate Major  ...  Mid-Career 90th Percentile Salary
Group                          ...
Business                   12  ...                                 12
HASS                       22  ...                                 22
STEM                       16  ...                                 16

[3 rows x 6 columns]

In [ ]:
clean_df.groupby('Group').mean()

             Spread  ...  Mid-Career 90th Percentile Salary
Group                ...
Business 103,958.33  ...                         147,525.00
HASS      95,218.18  ...                         129,363.64
STEM     101,600.00  ...                         157,625.00

[3 rows x 5 columns]

**Pivoting Tables with Dataframes:**

Sometimes you want to convert your DataFrame so that each category has its own column. The easiest way to accomplish this is by using the .pivot() method in Pandas. See the example below using a sample DataFrame.

In [ ]:
test_df = pd.DataFrame({'Age': ['Young', 'Young', 'Young', 'Young', 'Old', 'Old', 'Old', 'Old'],
                        'Actor': ['Jack', 'Arnold', 'Keanu', 'Sylvester', 'Jack', 'Arnold', 'Keanu', 'Sylvester'],
                        'Power': [100, 80, 25, 50, 99, 75, 5, 30]})
test_df

     Age      Actor  Power
0  Young       Jack    100
1  Young     Arnold     80
2  Young      Keanu     25
3  Young  Sylvester     50
4    Old       Jack     99
5    Old     Arnold     75
6    Old      Keanu      5
7    Old  Sylvester     30

In [ ]:
pivoted_df = test_df.pivot(index='Age', columns='Actor', values='Power')
pivoted_df

Actor  Arnold  Jack  Keanu  Sylvester
Age
Old        75    99      5         30
Young      80   100     25         50

Learning Points Summary:

Use ***.head()***, ***.tail()***, .shape and .columns to explore your DataFrame and find out the number of rows and columns as well as the column names.

Look for NaN (not a number) values with ***.findna()*** and consider using ***.dropna()*** to clean up your DataFrame.

You can access entire columns of a DataFrame using the square bracket notation: ***df['column name']*** or ***df[['column name 1', 'column name 2', 'column name 3']]***

You can access individual cells in a DataFrame by chaining square brackets ***df['column name'][index]*** or using ***df['column name'].loc[index]***

The largest and smallest values, as well as their positions, can be found with methods like ***.max()***, ***.min()***, ***.idxmax()*** and ***.idxmin()***

You can sort the DataFrame with .***sort_values()*** and add new columns with ***.insert()***

To create an Excel Style Pivot Table by grouping entries that belong to a particular category use the ***.groupby()*** method

To pivot data in a table, use the built in pandas function ***.pivot(index, columns, values)***